app/Http/Controllers/admin/SurveyController.php

select * from `surveys` order by `display_order` asc
---
    public function index()
    {
        $surveys = Survey::orderBy('display_order', 'ASC')->get();

delete from `surveys` where `id` = 94
---
    public function destroy($id)
    {
        Survey::find($id)->delete();